{
    "IntroSection": {
        "hello_im": "Hi, my name is",
        "name": "Ruo Yan",
        "short_intro": "I enjoy thinking about algorithms and building projects.",
        "download_cv": "Download CV",
        "blog": "Blog",
        "im_a": "I'm a",
        "role_frontend": "Frontend Developer",
        "role_game_engineer": "Game Developer",
        "role_solidity_engineer": "Blockchain Developer"
    },
    "SectionName": {
        "about": "About me",
        "experience": "Experience",
        "projects": "Projects",
        "skills": "Skills"
    },
    "AboutSection": {
        "desc": "I am a person who is very reliable in both work and life, someone who is obsessed with probability and game theory, and someone who loves mathematics, algorithms, and programming. My definition of 'reliable' is: if I promise you something, you can safely cross it off your TodoList. My interest in mathematics has been there since childhood, and later in high school I was exposed to informatics competitions, becoming addicted to solving algorithmic problems. Even now I often participate in Leetcode weekly contests. Naturally, I studied software engineering in university, and because I was obsessed with games, after graduation I went to work on game development for the then-top WeChat mini-game 'Idle Fish King'. After leaving that job, I started getting involved in web3 through some coincidences. I still remember my amazement when I first read the Bitcoin whitepaper - such a decentralized solution was truly genius, and at that moment I believed this technology would have great prospects. Later I went to the DNA Digital Nomad Community and discovered that there were many web3 practitioners in the nomad circle. I learned from the experts and gradually deepened my involvement in the web3 field, even finding a job developing games on the TON blockchain. In the blink of an eye, I've been struggling in the web3 circle for a year and a half, during which I witnessed the 419 night, saw Bitcoin rise from 40,000 to 130,000, during which I also played with runestones, rushed into meme coins, did airdrops, learned Solidity and Rust and some development tools, participated in many hackathons and won quite a few awards, trying to create things in this circle that could truly generate stable returns: Twitter KOL copy trading bots, quantitative trading strategies for secondary markets, attempted TON blockchain game tutorial entrepreneurship, MEV bots, but unfortunately none succeeded due to various reasons. In 2024, I met Brother Sao, who has been in the circle for a long time and is also someone with faith in decentralization, and happens to be an alumnus from my dream university CMU. During casual conversation, I learned he was working on an AI-based quantitative strategy workflow, a visual strategy generation tool that allows people who don't understand code to generate trading strategies. I was certain this was a very promising project, so I joined as a part-time developer. It's still in development, but has already received high praise and awards at many hackathons. Currently, I am preparing for web3 job hunting, wanting to enter web3 project teams for deep learning, hoping to get a job with growth potential."
    }
}